; domain
(define (domain gripper-strips)
   (:predicates (room ?r)
		(ball ?b)
		(gripper ?g)
		(at-robby ?r)
		(at ?b ?r)
		(free ?g)
		(carry ?o ?g))

   (:action move
       :parameters  (?from ?to)
       :precondition (and  (room ?from) (room ?to) (at-robby ?from))
       :effect (and  (at-robby ?to)
		             (not (at-robby ?from))))



   (:action pick
       :parameters (?obj ?room ?gripper)
       :precondition  (and  (ball ?obj) (room ?room) (gripper ?gripper)
			    (at ?obj ?room) (at-robby ?room) (free ?gripper))
       :effect (and (carry ?obj ?gripper)
		            (not (at ?obj ?room)) 
		            (not (free ?gripper))))


   (:action drop
       :parameters  (?obj  ?room ?gripper)
       :precondition  (and  (ball ?obj) (room ?room) (gripper ?gripper)
			    (carry ?obj ?gripper) (at-robby ?room))
       :effect (and (at ?obj ?room)
		            (free ?gripper)
		            (not (carry ?obj ?gripper)))))

; problem
(define (problem strips-gripper-soc)
   (:domain gripper-strips)
   (:objects roomr rooml ball1 ball2 hand)
   (:init (room roomr)
          (room rooml)
          (ball ball1)
          (ball ball2)
          (at-robby roomr)
          (free hand)
          (at ball1 rooml)
          (at ball2 rooml)
          (gripper hand))
   (:goal (and (at ball1 roomr)
               (at ball2 roomr))))

; plan
1. (move roomr rooml)
   deleted: (at-robby roomr)
   added: (at-robby rooml)
   goals met: 0 of 2
2. (pick ball2 rooml hand)
   deleted: (at ball2 rooml) (free hand)
   added: (carry ball2 hand)
   goals met: 0 of 2
3. (move rooml roomr)
   deleted: (at-robby rooml)
   added: (at-robby roomr)
   goals met: 0 of 2
4. (drop ball2 roomr hand)
   deleted: (carry ball2 hand)
   added: (at ball2 roomr) (free hand)
   goals met: 1 of 2
5. (move roomr rooml)
   deleted: (at-robby roomr)
   added: (at-robby rooml)
   goals met: 1 of 2
6. (pick ball1 rooml hand)
   deleted: (at ball1 rooml) (free hand)
   added: (carry ball1 hand)
   goals met: 1 of 2
7. (move rooml roomr)
   deleted: (at-robby rooml)
   added: (at-robby roomr)
   goals met: 1 of 2
8. (drop ball1 roomr hand)
   deleted: (carry ball1 hand)
   added: (at ball1 roomr) (free hand)
   goals met: 2 of 2
